"use strict";
//Оператор +

console.log('arr' + " - object") //arr -  object
console.log(4 + " - object") //4 -  object
console.log(4 + +" - object") //якщо перед строкою поставити + як в прикладі, то вона трансформується в число. Так як це текст, а не число, то отримаємо NaN
console.log(4 + +"5") //буде 9, бо 5 зі строки стало числом (поставили унарний +) і виконалась математична дія додавання

//Оператор incr/decr

let incr = 10;
    decr = 10;
    
// incr++; //збільшення на 1 - постфіксна форма запису
// decr--;  //зменшення на 1 - постфіксна форма запису

// ++incr; //збільшення на 1 - префіксна форма запису
// --decr;  //зменшення на 1 - префіксна форма запису

console.log(incr);
console.log(decr);

console.log(incr++); //постфіксна форма запису повертає спочатку початкове значення змінної, тобто 10
console.log(decr--); //постфіксна форма запису повертає спочатку початкове значення змінної, тобто 10

console.log(++incr); //префіксна форма запису збільшує початкове значення змінної на 1, тобто буде 11
console.log(--decr); //префіксна форма запису зменшує початкове значення змінної на 1, тобто буде 9

//Оператор %

console.log(5 % 2); //оператор, який повертає залишок від ділення, тобто в прикладі 1


//Оператор = оператор присвоєння

//Оператор == оператор порівняння нестрогий, який не враховує тип данних

console.log(2 * 4 == 8) //true
console.log(2 * 4 == '8') //true

//Оператор === оператор строгої рівності, який враховує тип данних

console.log(2 * 4 === '8') //false
console.log(2 * 4 === 8) //true

//Оператор логічний "і" - && - працює лише тоді, коли два чи більше значень являються правдивими

// const isChecked = true;
//       isClose = true;
// console.log(isChecked && isClose); //true

// const isChecked = true;
//       isClose = false;
// console.log(isChecked && isClose); //false


//Оператор логічний "або" - || - працює лише тоді, коли хоча б одне значення являюється правдивим

// const isChecked = true;
//       isClose = false;
// console.log(isChecked || isClose); //true, бо хоча б один із аргументів true

//Оператор заперечення "!"

// const isChecked = false;
//       isClose = false;
// console.log(isChecked || !isClose); //true, бо isClose через використання оператора ! з false стало true


