"use strict";

let num = 50;
// while (num <= 55) {
//     console.log(num);
//     num++ //збільшуєм на 1 кожну ітерацію
// }

// do {
//     console.log(num);
//     num++ //збільшуєм на 1 кожну ітерацію
// } while (num < 55)

//треба бути обережними, щоб не зробити цикл безкінечним,
//так якщо в прикладі нижче поставити i < 0, то умова ніколи не виконається
for (let i = 1; i < 8; i++) {
    console.log(num);
    num++
}
//буває, що треба за виконання якоїсь умови перервати виконання циклу,
//тоді використовують break(перериває виконання) або continue(пропускає умову, яку задали і виконує весь цикл)
for (let i = 1; i < 10; i++) {
    if(i === 6) {
        // break
        continue
    }
    console.log(i); 
}