"use strict" //режим строгого сучасного коду
//який дозволяє позбавлятися неточностей, які були в мові раніше, не допускає їх роботи
let number = 5;
const letBorderWidth = 1;

number = 10;
console.log(number);

//в JS не дивлячись на існування змінних const,
//як прямих констант в JS не існує, що доводить приклад нижче
const obj = {
    a: 50
};
obj.a = 10;

console.log(obj);

//застаріле var для оголошення змінних не використовуємо тому що:

console.log(name); //вона існує в коді кургом ще до того як була оголошена
//така поведінка називається всплиттям змінних в JS (hoisting)
var name = 'Ivan';
name = 'Alex';

//let та const видно лише в зоні коду, який обмежений фігурними дужками,
//тоді як var таку поведінку не підтримує і його видно поза дужками
{
    let result = 50;
}
console.log(result); 

//Назви файлів та змінних в JS:
//snake_case - написання назв папок і файлів через нижнє підкреслення LOWDASH
//UPPER_SNAKE_CASE - назва для змінної, яку не можна ніколи змінювати
//Kebab-case - для написання назв папок і файлів
//PascalCase - для назв класів JS, яка повинна починатися завжди з великої літери
//const _apiKey = 'gdhgfhdfghfd' - назва для змінної, яку не можна ніколи змінювати починається з нижнього підкреслення


